{"token_to_id": {"Abiotrophia": 4, "Acetatifactor": 5, "Acetivibrio": 6, "Acetomicrobium": 7, "Acholeplasma": 8, "Achromobacter": 9, "Acidaminococcus": 10, "Acidipropionibacterium": 11, "Acidovorax": 12, "Acinetobacter": 13, "Actinobaculum": 14, "Actinomyces": 15, "Actinotignum": 16, "Adlercreutzia": 17, "Aeriscardovia": 18, "Aerococcaceae": 19, "Aerococcus": 20, "Aeromonas": 21, "Agathobaculum": 22, "Aggregatibacter": 23, "Agitococcus": 24, "Agrobacterium": 25, "Akkermansia": 26, "Alcaligenes": 27, "Aliarcobacter": 28, "Alistipes": 29, "Alkalibacterium": 30, "Alkalicoccobacillus": 31, "Alkalihalobacillus": 32, "Alkalilimnicola": 33, "Alkaliphilus": 34, "Allisonella": 35, "Alloprevotella": 36, "Alloscardovia": 37, "Allosphingosinicella": 38, "Amedibacillus": 39, "Amycolatopsis": 40, "Anaerobiospirillum": 41, "Anaerobutyricum": 42, "Anaerococcus": 43, "Anaerocolumna": 44, "Anaerofilum": 45, "Anaerofustis": 46, "Anaeroglobus": 47, "Anaerolineaceae": 48, "Anaeromassilibacillus": 49, "Anaerosporobacter": 50, "Anaerostipes": 51, "Anaerotignum": 52, "Anaerotruncus": 53, "Aneurinibacillus": 54, "Anoxybacillus": 55, "Aquamicrobium": 56, "Arachnia": 57, "Arcanobacterium": 58, "Arthrospira": 59, "Aspergillus": 60, "Atlantibacter": 61, "Atopobium": 62, "Avibacterium": 63, "Bacillus": 64, "Bacteroidales": 65, "Bacteroides": 66, "Bacteroidetes": 67, "Barnesiella": 68, "Bavariicoccus": 69, "Bifidobacterium": 70, "Bilophila": 71, "Blastocystis": 72, "Blastomonas": 73, "Blautia": 74, "Bordetella": 75, "Bosea": 76, "Brachybacterium": 77, "Brachyspira": 78, "Bradyrhizobium": 79, "Brevibacillus": 80, "Brevibacterium": 81, "Brevundimonas": 82, "Brochothrix": 83, "Brucella": 84, "Burkholderia": 85, "Buttiauxella": 86, "Butyribacterium": 87, "Butyricicoccus": 88, "Butyricimonas": 89, "Butyrivibrio": 90, "Caldibacillus": 91, "Campylobacter": 92, "Candida": 93, "Candidatus": 94, "Capnocytophaga": 95, "Cardiobacterium": 96, "Carnobacterium": 97, "Catenibacterium": 98, "Catonella": 99, "Caulobacter": 100, "Cedecea": 101, "Cellulosilyticum": 102, "Cellulosimicrobium": 103, "Centipeda": 104, "Cetobacterium": 105, "Chelatococcus": 106, "Chlamydia": 107, "Christensenella": 108, "Chroococcidiopsis": 109, "Chryseobacterium": 110, "Citrobacter": 111, "Clavibacter": 112, "Cloacibacillus": 113, "Cloacibacterium": 114, "Clostridiales": 115, "Clostridioides": 116, "Clostridium": 117, "Collinsella": 118, "Comamonas": 119, "Companilactobacillus": 120, "Coprobacillus": 121, "Coprobacter": 122, "Coprococcus": 123, "Coprothermobacter": 124, "Corticimicrobacter": 125, "Corynebacterium": 126, "Criibacterium": 127, "Cronobacter": 128, "Cryptosporidium": 129, "Cupriavidus": 130, "Cutibacterium": 131, "Cytobacillus": 132, "Delftia": 133, "Dellaglioa": 134, "Denitrobacterium": 135, "Dermabacter": 136, "Dermacoccus": 137, "Desulfobulbus": 138, "Desulfomicrobium": 139, "Desulforamulus": 140, "Desulfovibrio": 141, "Desulfovibrionaceae": 142, "Dialister": 143, "Dickeya": 144, "Dielma": 145, "Dolosicoccus": 146, "Dolosigranulum": 147, "Dorea": 148, "Duncaniella": 149, "Dysgonomonas": 150, "Edwardsiella": 151, "Eggerthella": 152, "Eggerthia": 153, "Eikenella": 154, "Eisenbergiella": 155, "Elizabethkingia": 156, "Elusimicrobium": 157, "Empedobacter": 158, "Enhydrobacter": 159, "Enorma": 160, "Ensifer": 161, "Entamoeba": 162, "Enterobacter": 163, "Enterocloster": 164, "Enterococcus": 165, "Epilithonimonas": 166, "Eremococcus": 167, "Erwinia": 168, "Erysipelatoclostridium": 169, "Erysipelothrix": 170, "Escherichia": 171, "Eubacteriaceae": 172, "Eubacterium": 173, "Ewingella": 174, "Ezakiella": 175, "Facklamia": 176, "Faecalibacterium": 177, "Faecalibaculum": 178, "Faecalicatena": 179, "Faecalicoccus": 180, "Faecalitalea": 181, "Falseniella": 182, "Fannyhessea": 183, "Filifactor": 184, "Finegoldia": 185, "Firmicutes": 186, "Flavobacterium": 187, "Flavonifractor": 188, "Franconibacter": 189, "Fretibacterium": 190, "Frigoribacterium": 191, "Frischella": 192, "Fructilactobacillus": 193, "Fusicatenibacter": 194, "Fusobacterium": 195, "Gardnerella": 196, "Gemella": 197, "Gemmiger": 198, "Geobacillus": 199, "Gilliamella": 200, "Gleimia": 201, "Globicatella": 202, "Gluconobacter": 203, "Glutamicibacter": 204, "Gordonia": 205, "Gordonibacter": 206, "Granulicatella": 207, "Haemophilus": 208, "Hafnia": 209, "Halalkalibacterium": 210, "Halomonas": 211, "Harryflintia": 212, "Helicobacter": 213, "Herbaspirillum": 214, "Holdemanella": 215, "Holdemania": 216, "Hornefia": 217, "Hungatella": 218, "Hydrogenibacillus": 219, "Hydrogenoanaerobacterium": 220, "Hydrogenophilus": 221, "Ileibacterium": 222, "Immundisolibacter": 223, "Intestinibacter": 224, "Intestinimonas": 225, "Janibacter": 226, "Jeotgalibacillus": 227, "Johnsonella": 228, "Jonquetella": 229, "Kerstersia": 230, "Kingella": 231, "Klebsiella": 232, "Kluyvera": 233, "Kocuria": 234, "Kosakonia": 235, "Kouleothrix": 236, "Kurthia": 237, "Kytococcus": 238, "Lachnoanaerobaculum": 239, "Lachnoclostridium": 240, "Lachnospira": 241, "Lachnospiraceae": 242, "Lacrimispora": 243, "Lacticaseibacillus": 244, "Lactiplantibacillus": 245, "Lactobacillus": 246, "Lactococcus": 247, "Lactonifactor": 248, "Lancefieldella": 249, "Lapidilactobacillus": 250, "Laribacter": 251, "Latilactobacillus": 252, "Lautropia": 253, "Lawsonella": 254, "Lawsonia": 255, "Lawsonibacter": 256, "Leclercia": 257, "Leishmania": 258, "Lelliottia": 259, "Lentilactobacillus": 260, "Leptospira": 261, "Leptotrichia": 262, "Leucobacter": 263, "Leuconostoc": 264, "Levilactobacillus": 265, "Ligilactobacillus": 266, "Limnochorda": 267, "Limosilactobacillus": 268, "Liquorilactobacillus": 269, "Listeria": 270, "Loigolactobacillus": 271, "Lysinibacillus": 272, "Macrococcus": 273, "Mageeibacillus": 274, "Malassezia": 275, "Mammaliicoccus": 276, "Margalitia": 277, "Marvinbryantia": 278, "Massilia": 279, "Massilimicrobiota": 280, "Mediterranea": 281, "Megamonas": 282, "Megasphaera": 283, "Meiothermus": 284, "Melaminivora": 285, "Melissococcus": 286, "Mesomycoplasma": 287, "Mesorhizobium": 288, "Metamycoplasma": 289, "Methanobacterium": 290, "Methanobrevibacter": 291, "Methanomassiliicoccales": 292, "Methanosphaera": 293, "Methylobacterium": 294, "Methylorubrum": 295, "Methyloversatilis": 296, "Microbacterium": 297, "Micrococcus": 298, "Microlunatus": 299, "Microvirgula": 300, "Mitsuokella": 301, "Mixta": 302, "Mobiluncus": 303, "Moellerella": 304, "Mogibacterium": 305, "Monoglobus": 306, "Moraxella": 307, "Morganella": 308, "Morococcus": 309, "Mucispirillum": 310, "Muribaculum": 311, "Murimonas": 312, "Mycobacterium": 313, "Mycobacteroides": 314, "Mycolicibacterium": 315, "Mycoplasma": 316, "Mycoplasmopsis": 317, "Negativicoccus": 318, "Neisseria": 319, "Nocardia": 320, "Nocardiopsis": 321, "Obesumbacterium": 322, "Odoribacter": 323, "Oenococcus": 324, "Oligella": 325, "Olsenella": 326, "Oribacterium": 327, "Oscillibacter": 328, "Ottowia": 329, "Oxalobacter": 330, "Paenibacillus": 331, "Paeniclostridium": 332, "Paludisphaera": 333, "Pantoea": 334, "Parabacteroides": 335, "Paraburkholderia": 336, "Paraclostridium": 337, "Paracoccus": 338, "Paraprevotella": 339, "Pararheinheimera": 340, "Parascardovia": 341, "Parasutterella": 342, "Parvimonas": 343, "Pasteurella": 344, "Paucilactobacillus": 345, "Pauljensenia": 346, "Pectobacterium": 347, "Pediococcus": 348, "Pedobacter": 349, "Pelistega": 350, "Peptacetobacter": 351, "Peptoanaerobacter": 352, "Peptococcus": 353, "Peptoniphilus": 354, "Peptostreptococcaceae": 355, "Peptostreptococcus": 356, "Peribacillus": 357, "Phascolarctobacterium": 358, "Phocaeicola": 359, "Photobacterium": 360, "Phyllobacterium": 361, "Phytobacter": 362, "Plesiomonas": 363, "Pluralibacter": 364, "Porphyromonas": 365, "Pradoshia": 366, "Prauserella": 367, "Prescottella": 368, "Prevotella": 369, "Priestia": 370, "Prolinoborus": 371, "Propionibacterium": 372, "Propionimicrobium": 373, "Proteobacteria": 374, "Proteus": 375, "Providencia": 376, "Pseudescherichia": 377, "Pseudoalteromonas": 378, "Pseudocitrobacter": 379, "Pseudoflavonifractor": 380, "Pseudoglutamicibacter": 381, "Pseudoleptotrichia": 382, "Pseudomonas": 383, "Pseudonocardia": 384, "Pseudoramibacter": 385, "Psychrobacillus": 386, "Psychrobacter": 387, "Pulveribacter": 388, "Pyramidobacter": 389, "Pyrococcus": 390, "Rahnella": 391, "Ralstonia": 392, "Raoultella": 393, "Rheinheimera": 394, "Rhizobium": 395, "Rhodococcus": 396, "Rikenella": 397, "Robinsoniella": 398, "Rodentibacter": 399, "Romboutsia": 400, "Roseburia": 401, "Roseiflexus": 402, "Roseomonas": 403, "Rossellomorea": 404, "Rothia": 405, "Rubrobacter": 406, "Ruminococcaceae": 407, "Ruminococcus": 408, "Ruthenibacterium": 409, "Saccharomyces": 410, "Salipiger": 411, "Salmonella": 412, "Sanguibacteroides": 413, "Sarcina": 414, "Scardovia": 415, "Schaalia": 416, "Schleiferilactobacillus": 417, "Schwartzia": 418, "Secundilactobacillus": 419, "Sediminibacterium": 420, "Selenomonas": 421, "Sellimonas": 422, "Serratia": 423, "Sharpea": 424, "Shewanella": 425, "Shuttleworthia": 426, "Siccibacter": 427, "Simonsiella": 428, "Slackia": 429, "Sneathia": 430, "Sodalis": 431, "Solibacillus": 432, "Solobacterium": 433, "Sphingobacterium": 434, "Sphingobium": 435, "Sphingomonas": 436, "Sphingopyxis": 437, "Sporanaerobacter": 438, "Sporosarcina": 439, "Staphylococcus": 440, "Stenotrophomonas": 441, "Stomatobaculum": 442, "Streptococcus": 443, "Streptomyces": 444, "Stutzerimonas": 445, "Subdoligranulum": 446, "Succinatimonas": 447, "Superficieibacter": 448, "Synechococcus": 449, "Synergistes": 450, "Tannerella": 451, "Tatumella": 452, "Tepidimonas": 453, "Tepidiphilus": 454, "Terrisporobacter": 455, "Tetragenococcus": 456, "Thermoleophilum": 457, "Thermus": 458, "Thiohalorhabdus": 459, "Tissierellia": 460, "Tractidigestivibacter": 461, "Treponema": 462, "Trichococcus": 463, "Tropheryma": 464, "Trueperella": 465, "Turicibacter": 466, "Turicimonas": 467, "Tychonema": 468, "Tyzzerella": 469, "Ureaplasma": 470, "Vagococcus": 471, "Varibaculum": 472, "Variovorax": 473, "Veillonella": 474, "Veillonellaceae": 475, "Vibrio": 476, "Victivallis": 477, "Virgibacillus": 478, "Vogesella": 479, "Weissella": 480, "Weizmannia": 481, "Williamsia": 482, "Winkia": 483, "Wohlfahrtiimonas": 484, "Xanthomonas": 485, "Yersinia": 486, "Yokenella": 487, "Zymomonas": 488, "<pad>": 0, "<s>": 1, "</s>": 2, "<unk>": 3}, "id_to_token": {"4": "Abiotrophia", "5": "Acetatifactor", "6": "Acetivibrio", "7": "Acetomicrobium", "8": "Acholeplasma", "9": "Achromobacter", "10": "Acidaminococcus", "11": "Acidipropionibacterium", "12": "Acidovorax", "13": "Acinetobacter", "14": "Actinobaculum", "15": "Actinomyces", "16": "Actinotignum", "17": "Adlercreutzia", "18": "Aeriscardovia", "19": "Aerococcaceae", "20": "Aerococcus", "21": "Aeromonas", "22": "Agathobaculum", "23": "Aggregatibacter", "24": "Agitococcus", "25": "Agrobacterium", "26": "Akkermansia", "27": "Alcaligenes", "28": "Aliarcobacter", "29": "Alistipes", "30": "Alkalibacterium", "31": "Alkalicoccobacillus", "32": "Alkalihalobacillus", "33": "Alkalilimnicola", "34": "Alkaliphilus", "35": "Allisonella", "36": "Alloprevotella", "37": "Alloscardovia", "38": "Allosphingosinicella", "39": "Amedibacillus", "40": "Amycolatopsis", "41": "Anaerobiospirillum", "42": "Anaerobutyricum", "43": "Anaerococcus", "44": "Anaerocolumna", "45": "Anaerofilum", "46": "Anaerofustis", "47": "Anaeroglobus", "48": "Anaerolineaceae", "49": "Anaeromassilibacillus", "50": "Anaerosporobacter", "51": "Anaerostipes", "52": "Anaerotignum", "53": "Anaerotruncus", "54": "Aneurinibacillus", "55": "Anoxybacillus", "56": "Aquamicrobium", "57": "Arachnia", "58": "Arcanobacterium", "59": "Arthrospira", "60": "Aspergillus", "61": "Atlantibacter", "62": "Atopobium", "63": "Avibacterium", "64": "Bacillus", "65": "Bacteroidales", "66": "Bacteroides", "67": "Bacteroidetes", "68": "Barnesiella", "69": "Bavariicoccus", "70": "Bifidobacterium", "71": "Bilophila", "72": "Blastocystis", "73": "Blastomonas", "74": "Blautia", "75": "Bordetella", "76": "Bosea", "77": "Brachybacterium", "78": "Brachyspira", "79": "Bradyrhizobium", "80": "Brevibacillus", "81": "Brevibacterium", "82": "Brevundimonas", "83": "Brochothrix", "84": "Brucella", "85": "Burkholderia", "86": "Buttiauxella", "87": "Butyribacterium", "88": "Butyricicoccus", "89": "Butyricimonas", "90": "Butyrivibrio", "91": "Caldibacillus", "92": "Campylobacter", "93": "Candida", "94": "Candidatus", "95": "Capnocytophaga", "96": "Cardiobacterium", "97": "Carnobacterium", "98": "Catenibacterium", "99": "Catonella", "100": "Caulobacter", "101": "Cedecea", "102": "Cellulosilyticum", "103": "Cellulosimicrobium", "104": "Centipeda", "105": "Cetobacterium", "106": "Chelatococcus", "107": "Chlamydia", "108": "Christensenella", "109": "Chroococcidiopsis", "110": "Chryseobacterium", "111": "Citrobacter", "112": "Clavibacter", "113": "Cloacibacillus", "114": "Cloacibacterium", "115": "Clostridiales", "116": "Clostridioides", "117": "Clostridium", "118": "Collinsella", "119": "Comamonas", "120": "Companilactobacillus", "121": "Coprobacillus", "122": "Coprobacter", "123": "Coprococcus", "124": "Coprothermobacter", "125": "Corticimicrobacter", "126": "Corynebacterium", "127": "Criibacterium", "128": "Cronobacter", "129": "Cryptosporidium", "130": "Cupriavidus", "131": "Cutibacterium", "132": "Cytobacillus", "133": "Delftia", "134": "Dellaglioa", "135": "Denitrobacterium", "136": "Dermabacter", "137": "Dermacoccus", "138": "Desulfobulbus", "139": "Desulfomicrobium", "140": "Desulforamulus", "141": "Desulfovibrio", "142": "Desulfovibrionaceae", "143": "Dialister", "144": "Dickeya", "145": "Dielma", "146": "Dolosicoccus", "147": "Dolosigranulum", "148": "Dorea", "149": "Duncaniella", "150": "Dysgonomonas", "151": "Edwardsiella", "152": "Eggerthella", "153": "Eggerthia", "154": "Eikenella", "155": "Eisenbergiella", "156": "Elizabethkingia", "157": "Elusimicrobium", "158": "Empedobacter", "159": "Enhydrobacter", "160": "Enorma", "161": "Ensifer", "162": "Entamoeba", "163": "Enterobacter", "164": "Enterocloster", "165": "Enterococcus", "166": "Epilithonimonas", "167": "Eremococcus", "168": "Erwinia", "169": "Erysipelatoclostridium", "170": "Erysipelothrix", "171": "Escherichia", "172": "Eubacteriaceae", "173": "Eubacterium", "174": "Ewingella", "175": "Ezakiella", "176": "Facklamia", "177": "Faecalibacterium", "178": "Faecalibaculum", "179": "Faecalicatena", "180": "Faecalicoccus", "181": "Faecalitalea", "182": "Falseniella", "183": "Fannyhessea", "184": "Filifactor", "185": "Finegoldia", "186": "Firmicutes", "187": "Flavobacterium", "188": "Flavonifractor", "189": "Franconibacter", "190": "Fretibacterium", "191": "Frigoribacterium", "192": "Frischella", "193": "Fructilactobacillus", "194": "Fusicatenibacter", "195": "Fusobacterium", "196": "Gardnerella", "197": "Gemella", "198": "Gemmiger", "199": "Geobacillus", "200": "Gilliamella", "201": "Gleimia", "202": "Globicatella", "203": "Gluconobacter", "204": "Glutamicibacter", "205": "Gordonia", "206": "Gordonibacter", "207": "Granulicatella", "208": "Haemophilus", "209": "Hafnia", "210": "Halalkalibacterium", "211": "Halomonas", "212": "Harryflintia", "213": "Helicobacter", "214": "Herbaspirillum", "215": "Holdemanella", "216": "Holdemania", "217": "Hornefia", "218": "Hungatella", "219": "Hydrogenibacillus", "220": "Hydrogenoanaerobacterium", "221": "Hydrogenophilus", "222": "Ileibacterium", "223": "Immundisolibacter", "224": "Intestinibacter", "225": "Intestinimonas", "226": "Janibacter", "227": "Jeotgalibacillus", "228": "Johnsonella", "229": "Jonquetella", "230": "Kerstersia", "231": "Kingella", "232": "Klebsiella", "233": "Kluyvera", "234": "Kocuria", "235": "Kosakonia", "236": "Kouleothrix", "237": "Kurthia", "238": "Kytococcus", "239": "Lachnoanaerobaculum", "240": "Lachnoclostridium", "241": "Lachnospira", "242": "Lachnospiraceae", "243": "Lacrimispora", "244": "Lacticaseibacillus", "245": "Lactiplantibacillus", "246": "Lactobacillus", "247": "Lactococcus", "248": "Lactonifactor", "249": "Lancefieldella", "250": "Lapidilactobacillus", "251": "Laribacter", "252": "Latilactobacillus", "253": "Lautropia", "254": "Lawsonella", "255": "Lawsonia", "256": "Lawsonibacter", "257": "Leclercia", "258": "Leishmania", "259": "Lelliottia", "260": "Lentilactobacillus", "261": "Leptospira", "262": "Leptotrichia", "263": "Leucobacter", "264": "Leuconostoc", "265": "Levilactobacillus", "266": "Ligilactobacillus", "267": "Limnochorda", "268": "Limosilactobacillus", "269": "Liquorilactobacillus", "270": "Listeria", "271": "Loigolactobacillus", "272": "Lysinibacillus", "273": "Macrococcus", "274": "Mageeibacillus", "275": "Malassezia", "276": "Mammaliicoccus", "277": "Margalitia", "278": "Marvinbryantia", "279": "Massilia", "280": "Massilimicrobiota", "281": "Mediterranea", "282": "Megamonas", "283": "Megasphaera", "284": "Meiothermus", "285": "Melaminivora", "286": "Melissococcus", "287": "Mesomycoplasma", "288": "Mesorhizobium", "289": "Metamycoplasma", "290": "Methanobacterium", "291": "Methanobrevibacter", "292": "Methanomassiliicoccales", "293": "Methanosphaera", "294": "Methylobacterium", "295": "Methylorubrum", "296": "Methyloversatilis", "297": "Microbacterium", "298": "Micrococcus", "299": "Microlunatus", "300": "Microvirgula", "301": "Mitsuokella", "302": "Mixta", "303": "Mobiluncus", "304": "Moellerella", "305": "Mogibacterium", "306": "Monoglobus", "307": "Moraxella", "308": "Morganella", "309": "Morococcus", "310": "Mucispirillum", "311": "Muribaculum", "312": "Murimonas", "313": "Mycobacterium", "314": "Mycobacteroides", "315": "Mycolicibacterium", "316": "Mycoplasma", "317": "Mycoplasmopsis", "318": "Negativicoccus", "319": "Neisseria", "320": "Nocardia", "321": "Nocardiopsis", "322": "Obesumbacterium", "323": "Odoribacter", "324": "Oenococcus", "325": "Oligella", "326": "Olsenella", "327": "Oribacterium", "328": "Oscillibacter", "329": "Ottowia", "330": "Oxalobacter", "331": "Paenibacillus", "332": "Paeniclostridium", "333": "Paludisphaera", "334": "Pantoea", "335": "Parabacteroides", "336": "Paraburkholderia", "337": "Paraclostridium", "338": "Paracoccus", "339": "Paraprevotella", "340": "Pararheinheimera", "341": "Parascardovia", "342": "Parasutterella", "343": "Parvimonas", "344": "Pasteurella", "345": "Paucilactobacillus", "346": "Pauljensenia", "347": "Pectobacterium", "348": "Pediococcus", "349": "Pedobacter", "350": "Pelistega", "351": "Peptacetobacter", "352": "Peptoanaerobacter", "353": "Peptococcus", "354": "Peptoniphilus", "355": "Peptostreptococcaceae", "356": "Peptostreptococcus", "357": "Peribacillus", "358": "Phascolarctobacterium", "359": "Phocaeicola", "360": "Photobacterium", "361": "Phyllobacterium", "362": "Phytobacter", "363": "Plesiomonas", "364": "Pluralibacter", "365": "Porphyromonas", "366": "Pradoshia", "367": "Prauserella", "368": "Prescottella", "369": "Prevotella", "370": "Priestia", "371": "Prolinoborus", "372": "Propionibacterium", "373": "Propionimicrobium", "374": "Proteobacteria", "375": "Proteus", "376": "Providencia", "377": "Pseudescherichia", "378": "Pseudoalteromonas", "379": "Pseudocitrobacter", "380": "Pseudoflavonifractor", "381": "Pseudoglutamicibacter", "382": "Pseudoleptotrichia", "383": "Pseudomonas", "384": "Pseudonocardia", "385": "Pseudoramibacter", "386": "Psychrobacillus", "387": "Psychrobacter", "388": "Pulveribacter", "389": "Pyramidobacter", "390": "Pyrococcus", "391": "Rahnella", "392": "Ralstonia", "393": "Raoultella", "394": "Rheinheimera", "395": "Rhizobium", "396": "Rhodococcus", "397": "Rikenella", "398": "Robinsoniella", "399": "Rodentibacter", "400": "Romboutsia", "401": "Roseburia", "402": "Roseiflexus", "403": "Roseomonas", "404": "Rossellomorea", "405": "Rothia", "406": "Rubrobacter", "407": "Ruminococcaceae", "408": "Ruminococcus", "409": "Ruthenibacterium", "410": "Saccharomyces", "411": "Salipiger", "412": "Salmonella", "413": "Sanguibacteroides", "414": "Sarcina", "415": "Scardovia", "416": "Schaalia", "417": "Schleiferilactobacillus", "418": "Schwartzia", "419": "Secundilactobacillus", "420": "Sediminibacterium", "421": "Selenomonas", "422": "Sellimonas", "423": "Serratia", "424": "Sharpea", "425": "Shewanella", "426": "Shuttleworthia", "427": "Siccibacter", "428": "Simonsiella", "429": "Slackia", "430": "Sneathia", "431": "Sodalis", "432": "Solibacillus", "433": "Solobacterium", "434": "Sphingobacterium", "435": "Sphingobium", "436": "Sphingomonas", "437": "Sphingopyxis", "438": "Sporanaerobacter", "439": "Sporosarcina", "440": "Staphylococcus", "441": "Stenotrophomonas", "442": "Stomatobaculum", "443": "Streptococcus", "444": "Streptomyces", "445": "Stutzerimonas", "446": "Subdoligranulum", "447": "Succinatimonas", "448": "Superficieibacter", "449": "Synechococcus", "450": "Synergistes", "451": "Tannerella", "452": "Tatumella", "453": "Tepidimonas", "454": "Tepidiphilus", "455": "Terrisporobacter", "456": "Tetragenococcus", "457": "Thermoleophilum", "458": "Thermus", "459": "Thiohalorhabdus", "460": "Tissierellia", "461": "Tractidigestivibacter", "462": "Treponema", "463": "Trichococcus", "464": "Tropheryma", "465": "Trueperella", "466": "Turicibacter", "467": "Turicimonas", "468": "Tychonema", "469": "Tyzzerella", "470": "Ureaplasma", "471": "Vagococcus", "472": "Varibaculum", "473": "Variovorax", "474": "Veillonella", "475": "Veillonellaceae", "476": "Vibrio", "477": "Victivallis", "478": "Virgibacillus", "479": "Vogesella", "480": "Weissella", "481": "Weizmannia", "482": "Williamsia", "483": "Winkia", "484": "Wohlfahrtiimonas", "485": "Xanthomonas", "486": "Yersinia", "487": "Yokenella", "488": "Zymomonas", "0": "<pad>", "1": "<s>", "2": "</s>", "3": "<unk>"}}